Docs/xincoDMS_SOAP_Templates/remove_ace.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns1="urn:Xinco" xmlns:ns2="http://core.xinco.bluecubs.com" xmlns:ns3="http://xml.apache.org/xml-soap">
  <soapenv:Body>
    <ns1:removeXincoCoreACE soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <in0 soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns2:XincoCoreACE">
        <admin_permission soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="xsd:boolean">false</admin_permission>
        <changerID soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="xsd:int">0</changerID>
        <execute_permission soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="xsd:boolean">false</execute_permission>
        <xinco_core_data_id soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="xsd:int">0</xinco_core_data_id>
        <xinco_core_group_id soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="xsd:int">0</xinco_core_group_id>
        <xinco_core_node_id soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="xsd:int">0</xinco_core_node_id>
        <xinco_core_user_id soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="xsd:int">0</xinco_core_user_id>
        <id soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="xsd:int">ACE-ID</id>
        <read_permission soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="xsd:boolean">false</read_permission>
        <write_permission soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="xsd:boolean">false</write_permission>
      </in0>
      <in1 soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns2:XincoCoreUser">
        <change soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="xsd:boolean">false</change>
        <changerID soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="xsd:int">0</changerID>
        <email xsi:type="xsd:string"/>
        <firstname xsi:type="xsd:string"/>
        <id soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="xsd:int">0</id>
        <name xsi:type="xsd:string"/>
        <reason xsi:type="xsd:string"/>
        <status_number soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="xsd:int">1</status_number>
        <username xsi:type="xsd:string">USERNAME</username>
        <userpassword xsi:type="xsd:string">PASSWORD</userpassword>
        <writeGroups soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="xsd:boolean">false</writeGroups>
        <xinco_core_groups xsi:type="ns3:Vector" xsi:nil="true"/>
      </in1>
    </ns1:removeXincoCoreACE>
  </soapenv:Body>
</soapenv:Envelope>
